Revit 2027 API
FormArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	Form item
)
Public Overridable Sub Append (
	item As Form
)
public:
virtual void Append(
	Form^ item
)
abstract Append :
        item : Form -> unit
override Append :
        item : Form -> unit
Parameters
item Form
See Also
Reference
FormArray Class
Autodesk.Revit.DB Namespace